tingtom/eink-voice-agent/firmware/sdkconfig.defaults
# ESP-IDF sdkconfig defaults for E-Ink Voice Agent (ESP32-C6)
# Auto-generated - do not edit manually. Regenerate with:
#   idf.py set-target esp32c6 && idf.py save-defconfig

CONFIG_IDF_TARGET="esp32c6"

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TASK_FUNCTION_WRAPPER=y

CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752

CONFIG_LWIP_LOCAL_HOSTNAME="eink-voice-agent"
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=n

CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=n

CONFIG_ESP_WS_CLIENT_ENABLE_TLS=n

CONFIG_SPI_FLASH_WRITE_CHUNK_SIZE=8192
CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

CONFIG_ADC_CONTINUOUS_MODE=y
CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM=y

CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y

CONFIG_I2S_ISR_IRAM_SAFE=n

CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_DEFAULT_LEVEL_VERBOSE=n
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_IPC_TASK_STACK_SIZE=1536
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_UART_NUM=0

CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

CONFIG_ESP_HTTP_SERVER_ENABLE=n
CONFIG_ESP_NETIF_L2_TAP=n
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_STA=y
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_AP=n
